---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalResourceMatchOptions
source: html/5b194bf6-d3fc-9e1a-344d-ff9bbe3130e8.htm
---
# ExternalResourceMatchOptions Properties

Specifies whether the .NET object represents a valid Revit entity.